{"config": {"output_layers": [["prediction", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 224, 224, 3], "dtype": "float32"}, "name": "input_1", "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"use_bias": true, "trainable": false, "filters": 64, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "block1_conv1", "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "padding": "same"}, "name": "block1_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"use_bias": true, "trainable": false, "filters": 64, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "block1_conv2", "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "padding": "same"}, "name": "block1_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "name": "block1_pool", "data_format": "channels_last", "trainable": false}, "name": "block1_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"use_bias": true, "trainable": false, "filters": 128, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "block2_conv1", "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "padding": "same"}, "name": "block2_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"use_bias": true, "trainable": false, "filters": 128, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "block2_conv2", "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "padding": "same"}, "name": "block2_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "name": "block2_pool", "data_format": "channels_last", "trainable": false}, "name": "block2_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"use_bias": true, "trainable": false, "filters": 256, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "block3_conv1", "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "padding": "same"}, "name": "block3_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_conv1", 0, 0, {}]]], "config": {"use_bias": true, "trainable": false, "filters": 256, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "block3_conv2", "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "padding": "same"}, "name": "block3_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_conv2", 0, 0, {}]]], "config": {"use_bias": true, "trainable": false, "filters": 256, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "block3_conv3", "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "padding": "same"}, "name": "block3_conv3", "class_name": "Conv2D"}, {"inbound_nodes": [[["block3_conv3", 0, 0, {}]]], "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "name": "block3_pool", "data_format": "channels_last", "trainable": false}, "name": "block3_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block3_pool", 0, 0, {}]]], "config": {"use_bias": true, "trainable": false, "filters": 512, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "block4_conv1", "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "padding": "same"}, "name": "block4_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"use_bias": true, "trainable": false, "filters": 512, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "block4_conv2", "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "padding": "same"}, "name": "block4_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"use_bias": true, "trainable": false, "filters": 512, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "block4_conv3", "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "padding": "same"}, "name": "block4_conv3", "class_name": "Conv2D"}, {"inbound_nodes": [[["block4_conv3", 0, 0, {}]]], "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "name": "block4_pool", "data_format": "channels_last", "trainable": false}, "name": "block4_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"use_bias": true, "trainable": false, "filters": 512, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "block5_conv1", "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "padding": "same"}, "name": "block5_conv1", "class_name": "Conv2D"}, {"inbound_nodes": [[["block5_conv1", 0, 0, {}]]], "config": {"use_bias": true, "trainable": false, "filters": 512, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "block5_conv2", "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "padding": "same"}, "name": "block5_conv2", "class_name": "Conv2D"}, {"inbound_nodes": [[["block5_conv2", 0, 0, {}]]], "config": {"use_bias": true, "trainable": false, "filters": 512, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "block5_conv3", "bias_regularizer": null, "bias_constraint": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "kernel_size": [3, 3], "activation": "relu", "dilation_rate": [1, 1], "kernel_constraint": null, "strides": [1, 1], "padding": "same"}, "name": "block5_conv3", "class_name": "Conv2D"}, {"inbound_nodes": [[["block5_conv3", 0, 0, {}]]], "config": {"pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "name": "block5_pool", "data_format": "channels_last", "trainable": false}, "name": "block5_pool", "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["block5_pool", 0, 0, {}]]], "config": {"name": "flatten", "trainable": false}, "name": "flatten", "class_name": "Flatten"}, {"inbound_nodes": [[["flatten", 0, 0, {}]]], "config": {"use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "fc1", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 4096, "activation": "relu", "kernel_constraint": null, "trainable": false}, "name": "fc1", "class_name": "Dense"}, {"inbound_nodes": [[["fc1", 0, 0, {}]]], "config": {"use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "fc2", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 4096, "activation": "relu", "kernel_constraint": null, "trainable": false}, "name": "fc2", "class_name": "Dense"}, {"inbound_nodes": [[["fc2", 0, 0, {}]]], "config": {"rate": 0.5, "name": "dropout_1", "trainable": false}, "name": "dropout_1", "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0, {}]]], "config": {"use_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "name": "prediction", "bias_regularizer": null, "bias_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activity_regularizer": null, "units": 2, "activation": "softmax", "kernel_constraint": null, "trainable": true}, "name": "prediction", "class_name": "Dense"}]}, "keras_version": "2.0.6", "class_name": "Model", "backend": "tensorflow"}